# Credit Punctuation Model 

Developed by: Emiliano Mena González.

University: Instituto Tecnológico y de Estudios Superiores de Occidente (ITESO).

Degree: Finanacial Engineer.

Semester: 10th

In [3]:
import main as m

## Introduction
### Main objective
The main objective of this project is to create a Personal Credit Punctuation Model that classify every record of a dataset on one of three possible scores (Poor, Standard or Good). 
### Data
This model will take the data of the "train.csv" that includes multiple variables (work, number of bank accounts, credit utilization, income, etc.) and a final score.

In [4]:
m.df.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good

In [5]:
m.data_info

                             Type  NA_values  Present_values  Unique_values
Variable_name
ID                         object          0          100000         100000
Customer_ID                object          0          100000          12500
Month                      object          0          100000              8
Name                       object       9985           90015          10139
Age                        object          0          100000           1788
SSN                        object          0          100000          12501
Occupation                 object          0          100000             16
Annual_Income              object          0          100000          18940
Monthly_Inhand_Salary     float64      15002           84998          13235
Num_Bank_Accounts           int64          0          100000            943
Num_Credit_Card             int64          0          100000           1179
Interest_Rate               int64          0          100000           1750
Num_of_Loan                object          0          100000            434
Type_of_Loan               object      11408           88592           6260
Delay_from_due_date         int64          0          100000             73
Num_of_Delayed_Payment     object       7002           92998            749
Changed_Credit_Limit       object          0          100000           4384
Num_Credit_Inquiries      float64       1965           98035           1223
Credit_Mix                 object          0          100000              4
Outstanding_Debt           object          0          100000          13178
Credit_Utilization_Ratio  float64          0          100000         100000
Credit_History_Age         object       9030           90970            404
Payment_of_Min_Amount      object          0          100000              3
Total_EMI_per_month       float64          0          100000          14950
Amount_invested_monthly    object       4479           95521          91049
Payment_Behaviour          object          0          100000              7
Monthly_Balance            object       1200           98800          98792
Credit_Score               object          0          100000              3

### Delete the data it won´t be used
After analysing the data we first delete the variables that won´t be used on the model creation (ID, Month, Age, SSN, Occupation, Num_Bank_Accounts, Num_Credit_Card, Num_of_Loan, Type_of_Loan, Payment_of_Min_Amount, Payment_Behaviour).

### Null values
On the data description we see there are multiple variables with null values, in order to develop the model we need to first fill these values with other data. To do these we divide the variables that will be filled with 0 and the data that will be filled with the information of the same customer on the other records.

|Filled with customer info|Filled with 0          |
|-------------------------|-----------------------|
|Name                     |Num_of_Delayed_Payment |
|Annual_Income            |Num_Credit_Inquiries   |
|Monthly_Inhand_Salary    |Amount_invested_monthly|
|Interest_Rate            |Monthly_Balance        |
|Credit_Mix               |                       |
|Credit_History_Age       |                       |

### Numeric values
Then the numeric variables (Annual_Income, Num_of_Delayed_Payment, Changed_Credit_Limit, Outstanding_Debt, Amount_invested_monthly, Monthly_Balance) that were declared as string were converted to float numeric values.

### Change age format
Finally the last part of the data cleaning was to change the Credit_History_Age variable from a format "NN Years and NN Months" to only the number of months.

### Data to work with
After this we have now the clean data that we can see below.

In [6]:
m.df2.head()

,Customer_ID,Name,Annual_Income,Monthly_Inhand_Salary,Interest_Rate,Delay_from_due_date,Num_of_Delayed_Payment,Changed_Credit_Limit,Num_Credit_Inquiries,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Total_EMI_per_month,Amount_invested_monthly,Monthly_Balance,Credit_Score
0,CUS_0xd40,Rick Rothackerj,19114.12,1824.843333,3,3,7.0,11.27,4.0,Good,809.98,26.822620,319,49.574949,80.415295,312.494089,Good
1,CUS_0xd40,Rick Rothackerj,19114.12,1824.843333,3,-1,0.0,11.27,4.0,Good,809.98,31.944960,319,49.574949,118.280222,284.629162,Good
2,CUS_0xd40,Rick Rothackerj,19114.12,1824.843333,3,3,7.0,0.00,4.0,Good,809.98,28.609352,319,49.574949,81.699521,331.209863,Good
3,CUS_0xd40,Rick Rothackerj,19114.12,1824.843333,3,5,4.0,6.27,4.0,Good,809.98,31.377862,319,49.574949,199.458074,223.451310,Good
4,CUS_0xd40,Rick Rothackerj,19114.12,1824.843333,3,6,0.0,11.27,4.0,Good,809.98,24.797347,319,49.574949,41.420153,341.489231,Good

In [18]:
m.data_info_2

                             Type  NA_values  Present_values  Unique_values
Variable_name
Customer_ID                object          0          100000          12500
Name                       object          0          100000           9388
Annual_Income             float64          0          100000          12489
Monthly_Inhand_Salary     float64          0          100000          10954
Interest_Rate               int64          0          100000            300
Delay_from_due_date         int64          0          100000             73
Num_of_Delayed_Payment    float64          0          100000            711
Changed_Credit_Limit      float64          0          100000           4383
Num_Credit_Inquiries      float64          0          100000           1223
Credit_Mix                 object          0          100000              4
Outstanding_Debt          float64          0          100000          12203
Credit_Utilization_Ratio  float64          0          100000         100000
Credit_History_Age          int64          0          100000            393
Total_EMI_per_month       float64          0          100000          14950
Amount_invested_monthly   float64          0          100000          91049
Monthly_Balance           float64          0          100000          98793
Credit_Score               object          0          100000              3

## Model
### Model Bases
FICO Model
pay_his = ['Delay_from_due_date','Num_of_Delayed_Payment'] # Payment History 35%
debt = ['Outstanding_Debt'] # Amount Debt 30%
cred_his = ['Credit_History_Age'] # Credit History 10%
cred_req = ['Num_Credit_Inquiries'] # New Credit Requests 15%
typ_cred = ['Credit_Mix'] # Type of Credits 10%

Plus 
rate = ['Interest_Rate'] # Interest Rate 5%
cred_ut = ['Credit_Utilization_Ratio'] # Credit Utilization 5%
### Model Results

In [8]:
m.results

                  Name  FICO_Punctuation Final_Score Original_Score
0      Rick Rothackerj              1030        Good           Good
1      Rick Rothackerj              1010        Good           Good
2      Rick Rothackerj              1030        Good           Good
3      Rick Rothackerj               930        Good           Good
4      Rick Rothackerj              1010        Good           Good
...                ...               ...         ...            ...
99995            Nicks               880        Good           Poor
99996            Nicks               880        Good           Poor
99997            Nicks               880        Good           Poor
99998            Nicks               910        Good       Standard
99999            Nicks               880        Good           Poor

[100000 rows x 4 columns]

In [9]:
m.accuracy

0.54515

## Conclution